{
  "education": [
    {
      "awards_achievements": [
        "EnactusHacks 2020 3rd Place",
        "Dean's List (2019, 2020, 2021, 2023)",
        "GPA: 3.8/4.0"
      ],
      "degree": "Hons. Bachelor of Computer Science",
      "department": "Computer Science",
      "duration": "2018-2023",
      "school_name": "Western University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_LeonNasehi",
  "highlighted_projects": [
    {
      "description": "Tested various ML models for an ongoing investigative study to determine optimal concepts for an undergraduate CS curriculum. Implemented PyCarets topic modelling algorithm to form the basis of future research objectives, optimized accuracy by 90% by employing pre-processing techniques using Pandas and std libraries. Successfully defended research findings to a panel of professors, given final grade of 95%.",
      "git_url": null,
      "name": "Undergraduate Thesis"
    },
    {
      "description": "Python web-app hosted in AWS for NBA fans to easily stay up-to-date with season information. App was containerized with Kubernetes and data was retrieved using the API-NBA REST API. Ensured a modular design using the Model-View-Controller design pattern for the apps structure.",
      "git_url": null,
      "name": "NBA Central Basketball Desktop App"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Monitoring agent that performed automated health checks on the Rocky 9 VM instance it was running on. VM was hosted on GCP and the data gathered by the agent was inserted into a PostgreSQL database. The agent was automated with crontab and was written in bash.",
      "git_url": "https://github.com/jarviscanada/jarvis_data_eng_LeonNasehi/linux_sql",
      "name": "Cluster Monitor"
    }
  ],
  "name": "Leon Nasehi",
  "others": [
    {
      "bullets": [
        "Western Housing Residence Leader - London, ON",
        "Building Formal Council Commissioner, Delaware Hall - London, ON"
      ],
      "title": "Volunteer Experience"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Worked with a team of developers to deliver various projects in an agile scrum environment",
      "duration": "2024-present",
      "title": "Software Developer"
    },
    {
      "company": "Celestica",
      "description": "Built SAP BI reports and dashboards in PL/SQL with a team of developers in an agile environment. Routinely maintained SQL of report data sources, updating the existing data models as required. Strengthened data integrity through diligent oversight of Oracle DB ETL processes. Played a direct role in design and technical meetings with stakeholders on both theclient and management sides, successfully aligning visions with developer and QA expectations. Developed an Azure-based systemwith JavaScript to address a major ticket mis-assignment bug in ServiceNow that impacted five teams within the Data \u0026 Analytics department. Automated 60% of MS server maintenance tasks and implemented task diagnostic checks using PowerShell scripts.",
      "duration": "2021-2022",
      "title": "Data Warehouse Developer"
    }
  ],
  "skills": {
    "competent": [
      "Docker",
      "AWS",
      "Microsoft Server",
      "JavaScript",
      "Flask"
    ],
    "familiar": [
      "React",
      "Django",
      "Kubernetes",
      "MongoDB",
      "R"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git",
      "Python"
    ]
  },
  "summary": "Proactive and passionate software engineer with a strong foundation in diverse programming languages and frameworks. Adept at developing innovative solutions and optimizing data integrity through hands-on experience with various databases and industry-desired cloud providers. Recognized for outstanding academic achievements and leadership abilities, demonstrated through successful project completions and team management roles. Committed to continuous learning and driving technological advancements in the DevOps space. Skilled in Python, Java, SQL, and more, with a keen ability to adapt and excel in dynamic environments."
}
